app/controllers/dinners_controller.rb

SELECT * FROM "dinners" WHERE (Eventdate >= '2009-12-28 10:03:54')
---
  def index

        #we only want future dinners.
       @dinners = Dinner.find(:all, :conditions => ['Eventdate >= ?',DateTime.now])

SELECT * FROM "dinners" WHERE (Hostedby == 'john' and id==9) LIMIT 1
---
  def show
    @dinner = Dinner.find(params[:id])

SELECT * FROM "dinners" WHERE (Hostedby == 'bob' and id==1) LIMIT 1
---
  def edit
    @dinner = Dinner.find(params[:id])

SELECT * FROM "dinners" WHERE ("dinners"."id" = 10)
INSERT INTO "rsvps" ("updated_at", "Dinner_id", "Attendeename", "created_at") VALUES('2009-12-26 19:51:04', 10, 'user', '2009-12-26 19:51:04')
---
  def rsvp

      @msg = ""

      @dinner = Dinner.find(params[:id])

      #check to see if this user has already rsvp'd
      @rsvp = @dinner.IsUserRegistered(params[:user],@dinner.id)
      if @rsvp == nil
         #only get this far if the user has not already registered for this dinner.
         @rsvp = Rsvp.new(:Attendeename=>params[:user], :Dinner_id=>@dinner.id)
          if @rsvp.save

INSERT INTO "dinners" ("updated_at", "Contactphone", "Country", "Longitude", "Latitude", "Title", "Eventdate", "Hostedby", "Address", "Description", "created_at") VALUES('2009-12-19 21:57:44', '', '', '', '', 'New Dinner', '2009-12-19 21:57:00', 'John', '269 Vincent Road, Paoli, PA 19301', 'New Dinner', '2009-12-19 21:57:44')
---
  def create
    @dinner = Dinner.new(params[:dinner])

     respond_to do |format|
      if @dinner.save

SELECT * FROM "dinners" WHERE (Hostedby == 'john' and id==1) LIMIT 1
UPDATE "dinners" SET "Description" = 'New Year''s Eve PartyX', "updated_at" = '2009-12-27 04:25:31', "Eventdate" = '2000-01-01 08:45:00' WHERE "id" = 10
---
  def update
    @dinner = Dinner.find(params[:id])



    respond_to do |format|
    if @dinner.IsHostedBy(current_user.login, @dinner.id)
       if @dinner.update_attributes(params[:dinner])

SELECT * FROM "dinners" WHERE (Hostedby == 'john' and id==1) LIMIT 1
DELETE FROM "dinners" WHERE "id" = 3
---
  def destroy
    @dinner = Dinner.find(params[:id])

    @msg = "Your selected dinner [" + @dinner.Title + "] has been deleted."

   if @dinner.IsHostedBy(current_user.login, @dinner.id)
      @dinner.destroy