app/controllers/search_controller.rb

SELECT * FROM "dinners" WHERE (:Eventdate > '2010-01-14 08:40:19')
SELECT * FROM "dinners"
SELECT count(*) AS count_all FROM "rsvps" WHERE ("rsvps".dinner_id = 1)
---
      def SearchByLocation

        @latitude = params[:latitude]
        @longitude = params[:longitude]
        @location = params[:location]
        @distance = params[:distance]
	@origin = Geokit::Geocoders::YahooGeocoder.geocode(@location)

        @dinners = Dinner.find(:all, :conditions=> ["Eventdate > ?",Time.now.utc])

        @jsondinners = []
	@dinners.each do |dinner|
        @target = Geokit::Geocoders::YahooGeocoder.geocode(dinner.Address)
           @distance_to = @origin.distance_to(@target)
	   if  @distance_to <= @distance.to_i
              @jsondinner = JsonDinner.new(dinner.id,dinner.Title,dinner.Latitude,
	                                                dinner.Longitude,dinner.Description,
							dinner.Rsvp.count,@latitude,@longitude,
							@location,@distance_to)